# GetFirstProfileCurve Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RuledSurface..::..GetFirstProfileCurve Method
RuledSurface Class See Also
---
Returns a copy of the first profile curve if it is set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Curve GetFirstProfileCurve()
```

Visual Basic
---
```text
Public Function GetFirstProfileCurve As Curve
```

Visual C++
---
```text
public:
Curve^ GetFirstProfileCurve()
```

# ### Return Value
A copy of the first profile curve, if it exists. If a point was used to define the first profile, this function will return nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
RuledSurface Class
Autodesk.Revit.DB Namespace